{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_28.png",
  "image_name": "Page_28.png",
  "analysis": {
    "page_analysis": {
      "text_content": "Setback considerations\n\nEasements\nSome easements affect setbacks i.e., setbacks must be measured from the edge of the easement regardless of the lot line as illustrated in Fig 16 on this page. Easements that affect setbacks are:\n• Creek easements\n• Public street easements\n\nNote: most public utility easements do not affect setbacks.\n\nSidewalks\nThe sidewalk may not indicate the lot line. Often, the street easement or public right-of-way extends for several feet beyond the sidewalk. Fig 16 on this page illustrates this common circumstance and how the setbacks are affected i.e., they must be measured from the lot line regardless of the sidewalk.\n\nOddly shaped lots\nFor some lots, the setbacks and required yards may not be obvious. Fig 17 on page 23 indicates the appropriate site plan for lot shapes about which questions often arise:\n• flag lot (Fig 17 A)\n• corner lot (Fig 17 B)\n• through lot (Fig 17 D)\n• wedge-shaped lot (Fig 17 E)\n• lot with more than four sides (Fig 17 F & G)\n\nFlag & substandard lots\nFig 17 on page 23 also illustrates examples of setbacks that have been reduced for smaller or oddly shaped lots e.g.,\n• the front setback of a flag lot (Fig 17 A)\n• the street-side yard setback for substandard corner lots that are less than 50' wide (Fig 17 C)\n\n22",
      "visual_elements": [
        {
          "type": "diagram",
          "description": "Fig 16 Setbacks: easements and sidewalks - Shows a lot layout with easement at top (hatched area), rear yard, buildable area in center, interior side yards on left and right, front yard at bottom, and sidewalk. Includes annotations about setback measurements and key showing curb, lot line, sidewalk, required setbacks, buildable area, and easement symbols.",
          "location": "Right side of page, center"
        },
        {
          "type": "text box",
          "description": "Gray box containing note about creek easements contact information",
          "location": "Bottom right corner"
        }
      ],
      "technical_specifications": [
        {
          "parameter": "Substandard corner lot width threshold",
          "value": "50",
          "unit": "feet"
        },
        {
          "parameter": "Sidewalk to lot line spacing minimum",
          "value": "0",
          "unit": "feet or more"
        },
        {
          "parameter": "Maximum sidewalk to lot line spacing mentioned",
          "value": "15",
          "unit": "feet"
        }
      ],
      "structural_elements": {
        "main_heading": "Setback considerations",
        "subheadings": [
          "Easements",
          "Sidewalks",
          "Oddly shaped lots",
          "Flag & substandard lots"
        ],
        "sections": [
          "Easements",
          "Sidewalks",
          "Oddly shaped lots",
          "Flag & substandard lots"
        ]
      },
      "additional_notes": [
        "Page number 22 appears at bottom left",
        "Gray text box with white text in bottom right corner",
        "Diagram includes hatched pattern to indicate easement area",
        "Key/legend provided for diagram symbols"
      ],
      "cross_references": [
        "Fig 16 on this page",
        "Fig 17 on page 23",
        "Fig 17 A",
        "Fig 17 B",
        "Fig 17 D",
        "Fig 17 E",
        "Fig 17 F & G",
        "Fig 17 C",
        "See section on Lot Size for more information about creek easements",
        "See section on Lot Size for more information about public street easements",
        "Note: If the lot line is in the middle of the street, then the setback is measured from the edge of the public street easement or right-of-way",
        "Please ask at the Development Center"
      ]
    }
  },
  "analysis_timestamp": "2025-09-11 13:44:46",
  "model_used": "anthropic/claude-sonnet-4"
}