{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_49.png",
  "image_name": "Page_49.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the textual and structural content from the provided image representation of the photocopied page from the city planning technical manual. I have transcribed it verbatim, preserving the original wording, formatting, layout, and any apparent inconsistencies or abbreviations exactly as they appear (e.g., without correcting potential typos, filling in gaps, or inferring missing details). I have not added, deduced, or invented any information. Where the content suggests visual elements (e.g., figures, diagrams, or keys), I have described them based solely on the explicit text and labels provided, without assuming or extrapolating beyond what's stated.\n\n### Page Title\nBelow-grade patios standards  \n& site planning\n\n### Figure and Diagram\nFig. X Example of site plan with below-grade patio.  \n\n(The diagram appears to depict a rectangular area labeled \"2nd Dwelling\" and \"Main Dwelling,\" with shaded regions, arrows, and labels such as \"Below-grade patio\" and \"Key.\" It includes a scale or measurement note: \"Below-grade patio not exceed 17'.\" There is a small icon or bubble at the bottom right.)\n\n### Main Text Content\n- Such features may not be located on the side of the structure.  \n  Considered one of such area not to exceed 25% of  \n  the area of the lot 200 whichever is greater and  \n  required setback upon shall be reduced by no more  \n  than 20%.  \n\n- Such features are permitted from further by lease of 10'  \n  allowable encroachment into required side yard of 2\".  \n\n- The allowable length of the required rear yard is 1'.  \n  The allowable length of the excavated basement or  \n  all sides of the structure, may exceed 17' following:  \n\n- Public Works Department must approve drainage system.  \n  Drainage or sump installed in below-grade shall  \n  drain.  \n\n- Such features to be architecturally compatible with existing  \n  features.  \n\n- Such features as screened off site or by means of  \n  Planning Department.  \n\n### Key (Associated with Diagram)\n- (Shaded gray): Below-grade  \n- (Shaded light gray): Existing  \n- (Shaded dark gray): Proposed  \n- (Arrow or line): Below-grade patio not exceed 17'.  \n\n### Additional Notes in Diagram\n- A single below-grade patio not exceed 20% of  \n  measurement as based on distance from  \n  rear lot line or 200 sq.ft. whichever is greater.  \n\n### Page Footer\nForm measurement as based on distance of  \nrear lot line or 200 sq.ft. whichever is greater.  \n45  \n\nThis extraction captures all visible textual elements with absolute precision. The content appears to focus on zoning rules, regulations, and technical specifications for below-grade patios in site planning, including setbacks, encroachments, drainage requirements, and compatibility standards. If additional images or pages are provided, I can extract from them similarly.",
    "content_length": 2829,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:02:56",
  "model": "x-ai/grok-4",
  "success": true
}