{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_28.png",
  "image_name": "Page_28.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible text and structural elements from the provided image representation. I have transcribed it verbatim, preserving the original wording, formatting, punctuation, and layout as closely as possible based on the given content. I have not added, corrected, deduced, or interpreted any information (e.g., no assumptions about garbled text, missing context, or implied meanings). The extraction is organized by sections for clarity, but the content is not altered.\n\n### Main Heading\nSetback considerations\n\n### Section: Easements\nEasements that affect setbacks must be measured  \nfrom the edge of the easement regardless of the lot line on illustration  \nored Fig 36 on this page. Easements that affect setbacks are:  \n\n- Public street easements  \n- Most utility easements that do not affect setbacks  \n\nSidewalks  \nThe sidewalk is indicated for the lot line. Other street-  \nsidewalks. Fig on this page illustrates these common circum-  \nstances that the lot regardless of the sidewalks.  \n\nGodly shaped lots  \nFig 17 on page 29 indicates the appropriate guide for lot shapes  \nabout which affect other areas:  \n\n- comer lot (Fig 17 B)  \n- Through lot (Fig 17 D)  \n- lot with more than four sides (Fig 17 O)  \n\nFlag or substandard lots  \nFlag lots are more than 20 feet. Illustration examples of setbacks that have  \na lot of a flag lot (Fig 17 e.g.  \n- Rear yard setback shall be established corner lot that  \n  is 7.5 ft (Fig 17 C)  \n\n### Figure: Fig 36 Setback: easements and sidewalks\n[This appears to be a diagram with labels. The visible labels and annotations from the figure are extracted below exactly as they appear, without interpretation of the diagram's visual elements.]\n\n- Rear yard  \n- Setbacks are measured from easement  \n  line regardless of lot line. See note.  \n- Setbacks are measured from the lot line  \n  if it is further from the street than a  \n  sidewalk easement.  \n- Front yard  \n- May be between sidewalk. One  \n  street setback or sidewalk.  \n- Note: The setback between sidewalk and  \n  the lot line is part of the public  \n  right-of-way or on the Development  \n  Center.  \n- Key  \n  --- Lot line  \n  [ ] Sidewalk  \n  / / / Easement  \n- Note: For infill corner  \n  lots regarding creek  \n  Rio Santa Clara Valley  \n  Water District  \n\n### Page Footer\n27  \n\n*(End of visible content in the provided image representation. No additional text, rules, regulations, or specifications are present beyond what's transcribed above.)*",
    "content_length": 2494,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:59:55",
  "model": "x-ai/grok-4",
  "success": true
}