{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_44.png",
  "image_name": "Page_44.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible and legible text, labels, and diagram elements from the provided image. I have captured this information verbatim and with absolute precision, without adding, deducing, or fabricating any details. The extraction is organized by section for clarity, but the content is reproduced exactly as it appears in the image (including any apparent typos, abbreviations, or formatting). Non-text elements (e.g., the diagram) are described factually based solely on visible components, without interpretation.\n\n### Title and Subtitle\n- Attached garages/carports site planning\n- Attached garages comply with same setbacks as main dwelling.\n\n### Note\n- Note: Uncovered spaces must be located beyond the required frontyard and beyond the first 10' of the side/rear yard.\n\n### Figure Caption\n- Fig. 35 Example of site locations for attached garages/carports.\n\n### Diagram\nThe diagram consists of a horizontal layout divided into three labeled sections (A, B, and C) from left to right, each depicting a rectangular structure with shaded and unshaded areas, connected to a horizontal line at the bottom (likely representing a boundary). Each section includes a car icon and text labels. A key is provided on the right side of the diagram.\n\n- **Section A** (leftmost):\n  - Shaded rectangular area labeled: Main dwelling\n  - Attached unshaded rectangular area below it, labeled: Non-dwelling\n  - Car icon inside the unshaded area.\n  - Arrow pointing to the unshaded area with label: 2-car garage with space (enclosed?)\n\n- **Section B** (middle):\n  - Shaded rectangular area labeled: Main dwelling\n  - Attached unshaded rectangular area below it, labeled: Non-dwelling\n  - Car icon inside the unshaded area.\n  - Arrow pointing to the unshaded area with label: B Car garage with space (enclosed?)\n\n- **Section C** (rightmost):\n  - Shaded rectangular area labeled: Main dwelling\n  - Attached unshaded rectangular area below it, labeled: 1-car garage no space (enclosed?)\n  - Car icon inside the unshaded area.\n  - Arrow from the bottom of the section with label: C 1-car garage no space (enclosed?)\n\n- **Additional Diagram Labels**:\n  - Above Section A: Front yard\n  - Above Section B: Front yard\n  - Above Section C: Front yard\n  - Horizontal line at the bottom connecting all sections, with a bracket and label: Beyond required frontyard\n\n### Key (Legend)\nLocated on the right side of the diagram, with symbols and corresponding labels:\n- [Shaded rectangle] Main dwelling\n- [Unshaded rectangle] Attached garage\n- [Dashed or hatched area] Carport\n- [Car icon] Parking\n- [Arrow or line] Setback\n- [Other symbol] Property line\n\n### Page Number and Footer\n- 35\n- A 2-car garage with space (enclosed?) B Car garage with space (enclosed?) C 1-car garage no space (enclosed?)\n\nNo additional text, rules, regulations, or specifications are visible in the image beyond what is extracted above. If more images or pages are provided, I can extract from them similarly.",
    "content_length": 2982,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:02:11",
  "model": "x-ai/grok-4",
  "success": true
}