{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_08.png",
  "image_name": "Page_08.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible text and structured content from the provided image (which appears to be a scanned or photocopied page from a city planning technical manual). I have transcribed it verbatim, maintaining the original layout, formatting, headings, tables, and wording as closely as possible based on what's shown. No information has been added, inferred, deduced, or invented—only what's explicitly present in the image text is included. I've organized it into sections for clarity, but the content is not altered.\n\n### Main Heading\nLot size\n\n### Subheading (Left Column)\nMinimum & maximum lot sizes\n\n### Body Text (Left Column)\nThe characteristics of a subdivision extend through annexation, such as the lot sizes developed under former annexation. Fig. 1 criteria.\n\nlot determines its development potential and overall character. These also determine the appearance of the cityscape throughout the allowable building in a percentage of this based.\n\nFor example, to...\n\n### Subheading (Left Column, Continued)\nExemptions\n\n- Where underlying lot must be retained in clinic.\n- Where subdivision and lot less than lot size of 20' in width or adjusted lot less than 20' in width.\n- lot size of housing in lot size not increasing 20 days.\n\n### Subheading (Right Column)\nSubstandard lots\n\nSmaller lots than the following are a variety of site considered to be substandard.\n\nSubstandard lot sizes by zone\n\nA) width for one walk. 87' AND\n\nZone | District | Typical lot | Flag lot\n\nR1 | 7500 | 5,000 | 0.578\n\nR1 | 10000 | 6,000 | 7,000\n\nR1 | 15000 | 10,000 | 12,000\n\nR1 | 20000 | 20,000 | 20,000\n\nSpecial regulations for substandard lots\n\n- For lots less than 50' deep, the required street yard.\n- For lots less than 50' deep, the regulations about locating in a half lot or the rear yard such that it be in front half lot.\n\nNote: Determining where lot requires a boundary survey.\n\n### Additional Subheadings and Text (Scattered/Overlapping)\nMile. A. max 50' AND 200' lot size.\n\nWith 50' AND 100' 200' 400\n\nZone District | Minimum | Maximum\n\nR1 | 5000 | 0.500\n\nR1 | 7500 | 0.750\n\nR1 | 10000 | 1.000\n\nR1 | 15000 | 1.500\n\nR1 | 20000 | 20,000 | 20,000\n\nExemption from the max. lot size\n\nWhere underlying lot must be retained in clinic.  \nnative subdivision and lot less than lot size of 20' in  \nWhere or adjusted lot less than 20' in  \nlot size of housing in lot size not increasing 20 days.  \nThe max and min for lot size not housing.\n\n### Figure/Illustration References\n- Fig. 1 criteria.\n- Typical lot | Flag lot (in table).\n\n### Notes on Extraction\n- The image text appears partially obscured, fragmented, or affected by photocopying artifacts (e.g., overlapping lines, incomplete sentences, or scanning errors like \"clinic\" possibly being a mis-scan of \"clinic\" or similar— but I have not corrected or assumed anything).\n- No images, diagrams, or non-text elements (beyond the implied \"Fig. 1\") are visible in the provided content, so none are extracted.\n- All content revolves around zoning rules for lot sizes, including minimum/maximum specifications, substandard lots, exemptions, and special regulations, as per the image.\n\nIf you provide additional images or pages, I can extract from those with the same precision.",
    "content_length": 3243,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:57:31",
  "model": "x-ai/grok-4",
  "success": true
}