{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_09.png",
  "image_name": "Page_09.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible text and diagram descriptions from the provided image of the photocopied page(s) from the city planning technical manual. I have transcribed the content exactly as it appears, without any additions, corrections, deductions, interpretations, or assumptions. This includes preserving any apparent typos, abbreviations, or inconsistencies in the text (e.g., \"lot let area\" is transcribed as shown, without assuming it means \"lot area\"). I have organized it into sections for clarity based on the layout, but only using the explicit content from the image. No zoning rules, regulations, or technical specifications have been inferred or expanded beyond what is directly visible.\n\n### Main Title\nGross vs. net lot area\n\n### Main Text Block 1\nGross lot area is the lot let area from the lot line to the lot line.  \nDevelopment potential is based on the lot area and  \nincluded from the gross lot area is sustainable lot not area.  \nexcluded from the gross lot area is sustainable lot not area.\n\n### Main Text Block 2\nAreas excluded from the gross lot area:  \n- Public portion of a flag lot (see Fig. 2 on this page)  \n- Canals channeled (see Fig. 2 on this page?)\n\n### Figure 1\nFig. 1 Gross lot area exclusions, street easements.\n\n[Diagram: Appears to show a horizontal layout with labels including:]  \nThe portion of the lot within the  \nfuture right-of-way line.  \nHas the gross lot area.  \nHome is some area. Public. The  \npublic ROW is the public easement or  \ndedge in the Development Court.\n\n[Additional diagram elements:]  \nKey:  \nStreet  \nSidewalk  \nCurb  \nArea front and gross from gross lot area.\n\n### Figure 2\nFig. 2 Gross lot area exclusions, flag lot \"joke?\"\n\n[Diagram: Appears to show a vertical layout with labels including:]  \nFlag lot with  \npublic easement.  \nThe portion of the lot with a  \npublic easement.  \nThe gross lot area.  \nA portion easement excluded.  \nNot included in gross lot area.\n\n### Figure 3\nFig. 3 Gross lot area exclusions, creek easements.\n\n[Diagram: Appears to show a horizontal layout with labels including:]  \nThe portion of the lot with a  \ncreek easement.  \nThe gross lot area.  \nHome is some area. Public. The  \nsubmerged by delivered Santa Clara.  \nCounty is easement. The floodplain.  \nEasement is easement. The floodplain.\n\n[Additional diagram elements:]  \nKey:  \nCreek  \nSodbank  \nArea front and gross from gross lot area.  \nLot line.\n\n### Page Footer\n3",
    "content_length": 2441,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:57:30",
  "model": "x-ai/grok-4",
  "success": true
}