{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_36.png",
  "image_name": "Page_36.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible text from the provided image representation of the photocopied page from the city planning technical manual. I have transcribed it verbatim, maintaining the original structure, formatting, wording, and any apparent inconsistencies or cutoffs (e.g., ellipses or incomplete phrases) as they appear. I have not added, deduced, interpreted, or filled in any missing information—only what is explicitly present in the provided \"image\" text is included. For clarity, I have organized the extraction into sections based on the page's apparent layout (e.g., headers, body text, lists, and notes), but the content itself is unchanged.\n\n### Page Header\nAccessory Structures (other than 2nd dwelling units)\n\n### Main Body Text (Top Section)\nThere are no minimum lot size requirements for non-dwelling accessory structures. The regulations are as follows:\n\nAll accessory structures...\n\n- Must have a use incidental to main dwelling\n- Must be detached at least 7 feet from main dwelling\n- Count toward the lot coverage\n- If over 120 sq ft, a building permit and count toward\n\n### Main Body Text (Middle Section)\nAccessory structures located in the required setback...\n\n- May be located in the rear yard\n- May be located on the year of a through lot\n- May be located along or near yard\n- May subject the accessory structures height and daylight\n- May have a size of 120 sq ft or 10?\n- Count toward the lot coverage\n- If over 120 sq ft, have to have two flanking permit and count toward\n- If over 200 sq ft, have to have two flanking permit and count toward\n\n### Sidebar/Note (Right Side)\nNote: Accessory structures less than 120 do not require comply with all zoning regulations.\n\n### Additional Visible Elements\n- Page number (bottom): 30\n- Marginal text (left side, appears to be a separate note or preamble): \n  - The code commonly chooses regarding accessory structures while utilizing para- the daylight plane to preserve the charac- an neighborhood well privacy and day- light to each lot. NOT the total\n- Other apparent headers or labels: \n  - Accessary structure Standards (handwelling) [Note: This appears at the very top, possibly a section title with a typo or artifact.]\n  - Accessory structures located in the required setback... [Repeated or continued from main body.]\n\nThis extraction captures all discernible text with absolute precision based on the provided image representation. If additional images or pages are provided, I can extract from them similarly.",
    "content_length": 2507,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:01:10",
  "model": "x-ai/grok-4",
  "success": true
}