{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_29.png",
  "image_name": "Page_29.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible content from the provided image of the photocopied page from the city planning technical manual. I have transcribed and described only what is explicitly present in the image, without any additions, deductions, interpretations, or invented details. The content appears to be a figure (Fig. 17) illustrating zoning-related concepts for setbacks on irregularly shaped lots, including a title, key, diagrams, and labels. I have organized the extraction into sections for clarity, but the structure mirrors the layout in the image.\n\n### Page Title/Heading\n- \"Determining setbacks on oddly shaped lots\"\n\n### Figure Caption\n- \"Fig. 17: Setbacks for oddly shaped lots\"\n\n### Key/Legend (Located in the top-left area)\n- Key:\n  - Curb\n  - Lot line\n  - Flag lot\n  - Background [Note: This appears as a label, possibly indicating shaded or filled areas in the diagrams.]\n\n### Diagrams\nThe image contains a series of schematic diagrams (approximately 7-8 in total, arranged in a somewhat scattered layout across the page, with arrows and labels pointing to specific features). Each diagram depicts lot shapes, boundaries, and setback-related elements. I describe them in the order they appear from left to right and top to bottom, based on the visible layout. Diagrams include simple line drawings of lots with labels for yards, streets, and other features. No numerical measurements, rules, or textual regulations are visible beyond the labels and title—only illustrative diagrams.\n\n1. **Top-left diagram** (rectangular lot with a flag-like extension):\n   - Labeled: \"Flag lot\"\n   - Features: A narrow extension (pole-like) connecting to a wider area, with \"Front yard\" labeled on the wider area.\n   - Additional labels: \"Street\" at the base.\n\n2. **Top-middle diagram** (irregular polygonal lot):\n   - Labeled: \"Front yard\" (on one side), \"Side yard\" (on adjacent sides), \"Rear yard\" (on the opposite side).\n   - Features: Dotted lines indicating setbacks; a central shaded area marked with a dot.\n   - Additional labels: \"Street\" at the bottom.\n\n3. **Top-right diagram** (L-shaped lot):\n   - Labeled: \"Front yard 20'\" (with an arrow pointing to a measurement line), \"Rear yard\" (on the back), \"Side yard\" (on sides).\n   - Features: Curved or angled boundaries; a central shaded area.\n   - Additional labels: \"Street\" at the front.\n\n4. **Middle-left diagram** (curved or arc-shaped lot):\n   - Labeled: \"Through lot\"\n   - Features: An arc-shaped boundary with a line through the center; shaded areas on either side.\n   - Additional labels: \"Street\" on both ends.\n\n5. **Middle-center diagram** (triangular or wedge-shaped lot):\n   - Labeled: \"Irregular shaped lot\"\n   - Features: Pointed end with setbacks marked; central dot.\n   - Additional labels: \"Front yard 20'\" (with arrow), \"Rear yard\".\n\n6. **Middle-right diagram** (polygonal lot with indentation):\n   - Labeled: \"Lot with a side lot line shorter than 50'\"\n   - Features: Indented side; shaded central area.\n   - Additional labels: \"Front yard\", \"Rear yard\", \"Side yard\".\n\n7. **Bottom-left diagram** (curved lot with radial lines):\n   - Labeled: \"The rear yard is measured 20' from the rear lot line.\"\n   - Features: Curved boundary with radial measurement lines.\n   - Additional labels: \"Street\".\n\n8. **Bottom-right diagram** (rectangular lot with extension):\n   - Labeled: \"Rear lot line\"\n   - Features: Extended rear area; shaded sections.\n   - Additional labels: \"Front yard\", \"Side yard\".\n\n### Additional Page Elements\n- Page number (bottom-right): \"23\"\n- No other text, rules, regulations, or technical specifications are visible in the image beyond the title, figure caption, key, diagram labels, and page number. The content is purely illustrative, focusing on visual examples of setback determinations for various lot shapes.\n\nIf additional images or pages are provided, I can extract from them similarly.",
    "content_length": 3904,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:00:09",
  "model": "x-ai/grok-4",
  "success": true
}