{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_50.png",
  "image_name": "Page_50.png",
  "analysis": {
    "raw_content": "Below is a precise extraction and transcription of the visible text content from the provided image of the photocopied page from the city planning technical manual. I have transcribed it verbatim, preserving the original wording, structure, formatting, abbreviations, and any apparent inconsistencies or cutoffs (e.g., due to image quality or photocopying artifacts) as they appear in the image description. I have not added, deduced, or inferred any missing information, nor have I corrected any potential errors in the original text. For clarity, I have organized the transcription into sections mirroring the document's layout (e.g., headings, tables, and bullet points), but the content itself is unchanged.\n\n### Main Heading\n2nd-dwelling units standards & site planning\n\n### Introductory Text\nLots that meet the minimum size may have an attached or detached 2nd-dwelling unit  \nmust comply with all regulations applying to the main dwelling except as follows:\n\n### Attached Unit Section\nAttached unit  \n\n- Lot size must remain for zone (see table)  \n- The size of the 2nd-dwelling unit may not exceed 50% of the floor area of the main dwelling or 1,200 sq ft, whichever is less  \n- Maximum two bedrooms for parking (see below)  \n- Must have two covered parking spaces (may be tandem)  \n- Minimum open space: 300 sq ft (may be shared)  \n- Exterior access: must face away from street or be located toward interior side or rear yard like the main dwelling. (Fig A or B)  \n- Counts toward FAR for the lot  \n\nAlts. size min for 2nd dwelling unit by zone  \n\n| Zone District | Typical lot | Flag lot |  \n|---------------|-------------|----------|  \n| B-1          | 8,000      | 7,500 sf |  \n| R-1/5000     | 5,000      | 4,500 sf |  \n| R-1/10000    | 10,000     | 9,000 sf |  \n| R-1/11000    | 11,000     | 10,000 sf|  \n| R-1/20000    | 20,000     | 19,000 sf|  \n\n### Detached Unit Section\nDetached unit (Fig A or B, p.42)  \n\n- Lot size must remain for zone (see table)  \n- Minimum site area: 5,000 sq ft for detached unit  \n- Size not to exceed total floor area (one floor: 1,200 sq ft)  \n- Must have two covered parking spaces (may be tandem)  \n- Minimum open space: 300 sq ft (may be shared)  \n- Must be technically compatible with main dwelling  \n- Must be located 17 ft from main dwelling  \n- Must have exterior access facing away from street or be located toward interior side or rear yard like the main dwelling. (Fig A or B)  \n- Counts toward FAR for the lot  \n\nParking for 2nd-dwelling units is treated  \nthe same as parking for the main residence. See  \n\"Parking\" in the \"Parking\" section of this manual.  \n\nNote: with attached for parking in this manual.  \ne.g., two-car garage in zone Fig 17C.5.8  \n\n### Additional Notes on Extraction\n- The image appears to be a single page (or excerpt) focused on zoning rules, regulations, and technical specifications for second-dwelling units (e.g., accessory dwelling units or ADUs) in a city planning context.\n- References to figures (e.g., \"Fig A or B\", \"Fig 17C.5.8\") and pages (e.g., \"p.42\") are included as they appear, but no actual images or diagrams are visible in the provided description.\n- Some text seems partially cut off or abbreviated (e.g., \"Alts. size min\" likely means \"Alternate size minimum,\" but I have not expanded or assumed this). Table headers and values are transcribed exactly.\n- No other content (e.g., additional pages, images, or context) is visible or extractable from the provided image description.\n\nIf you provide additional images or pages, I can extract from those as well.",
    "content_length": 3559,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:03:06",
  "model": "x-ai/grok-4",
  "success": true
}