{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_27.png",
  "image_name": "Page_27.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible text, diagrams, and other elements from the provided image content. I have transcribed all readable text verbatim, without any additions, deductions, interpretations, or invented details. Where diagrams or figures appear, I have described them factually based solely on the visible elements (e.g., labels, arrows, shapes) without inferring meaning or context beyond what is explicitly shown. The content appears to be from a single page (page 21) of a city planning technical manual focused on zoning regulations, specifically contextual front setbacks.\n\n### Extracted Text (Verbatim Transcription)\n- **Heading:** Contextual front setbacks\n- **Main Body Text:** Contextual setbacks apply if, and only if, the average of the existing setbacks on the same side of the block is 30' or greater.\n- **Subheading:** How to determine if a contextual setback applies (Fig. 13 below, as example)\n- **Diagram Labels and Text (from left to right in the upper diagram):**\n  - One block here\n  - Name a block more than 500' long, 500' to 1,000'.\n  - Arrow pointing right: Exclude the following types of lots\n    - Flag lots (1)\n    - Corner lots (2) with (3) frontage on (4) street\n    - Lots containing more than one building\n  - Arrow pointing right: You can exclude the deepest and shallowest setbacks if the block has 5 or more lots\n  - Arrow pointing right: Find the average of the remaining setbacks\n  - Text with calculation: Run 30' average, greater than or equal to 30' = 32.7'\n- **Figure Caption:** Fig. 13 Example of a block with a contextual setback of 32'\n- **Key (at bottom right of lower diagram):** Key, Natural, Building, [small black bar]\n\n### Description of Diagrams and Visual Elements\nThe page contains two main visual elements: an upper flowchart-style diagram and a lower schematic diagram of a block with buildings. These are described below based solely on visible shapes, labels, and positions, without any added interpretation.\n\n- **Upper Diagram (Flowchart):**\n  - This is a horizontal flowchart with arrows connecting steps from left to right.\n  - Left section: A rectangular box labeled \"One block here\" with subtext \"Name a block more than 500' long, 500' to 1,000'.\"\n  - Arrow points right to a box: \"Exclude the following types of lots\" followed by a bulleted list:\n    - Flag lots (1)\n    - Corner lots (2) with (3) frontage on (4) street\n    - Lots containing more than one building\n  - Arrow points right to a box: \"You can exclude the deepest and shallowest setbacks if the block has 5 or more lots\"\n  - Arrow points right to a box: \"Find the average of the remaining setbacks\"\n  - Final right section: A calculation shown as \"30 A\" with subtext \"+ 29.9 = 32.7'\" (appears to be a mathematical example, possibly \"30' average, greater than or equal to 30' = 32.7'\").\n\n- **Lower Diagram (Block Schematic):**\n  - This is a horizontal illustration of a city block, depicted as a straight line with multiple building-like shapes (rectangular or wedge-shaped) placed along it, labeled from left to right as A, B, C, D, E, F, G, H.\n  - Each building shape has a label above or on it indicating a setback distance (e.g., \"Single Family\" or similar partially obscured text on some).\n  - The buildings are shaded in gray tones, with lines extending from them (possibly representing setbacks or frontages).\n  - At the bottom right, there is a small key legend with the words \"Key\", \"Natural\", \"Building\", and a small black horizontal bar.\n  - No additional colors, scales, or measurements are visible beyond what's transcribed above.\n\n### Additional Page Details\n- **Page Number:** 21 (visible at the bottom right).\n- No other text, images, or elements are present in the provided content. The page appears to be in black-and-white or grayscale, with a clean layout typical of a technical manual.",
    "content_length": 3852,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:59:53",
  "model": "x-ai/grok-4",
  "success": true
}