{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_12.png",
  "image_name": "Page_12.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible text content from the provided image of the photocopied page from the city planning technical manual. I have transcribed it verbatim, maintaining the original structure, formatting, headings, numbering, and wording as closely as possible based on what is legible in the image. No information has been added, deduced, inferred, or fabricated—only direct text from the image is included. Any apparent OCR artifacts or distortions in the rendered image text (e.g., minor garbling) have been preserved without correction or interpretation. Illegible or partially obscured portions are noted as such where they appear.\n\n---\n\n**Porches**  \n**&**  \n**Entry**  \n**Features**\n\n**Porch types**\n\nFor purpose of assessing floor area, porches, entryways, and balconies et.  \nThese categories fall into one of these categories:\n\n1. **Non-roofed porches** entryways, balconies et.  \n   - Non-roofed porches generally do not count\n\n2. **Roofed porches** the lot floor if A & B apply. Fig. 1, Fig. a)  \n   - System of determination whether or these count  \n   - They are less than 1/2 the lot floor  \n   - That are less than 12\" high grades Fig. 1(b) 7.  \n\n   - Three count negligible of the design including openers.\n\n3. **Roofed entry features** on the 1st floor that are more than 12\".  \n   Fig. 2 (a) & Fig. 2 (b).  \n\n4. **Recess porches**  \n   - Recess porches on the 1st floor Fig. 3(a), 3(b).  \n   - Height, depth, & system determine whether or not count  \n   - If they count and are more than 17\" high, they count twice.\n\n5. **Roofed balconies/outdoor areas on upper floors** Fig. 4(a) 5(5).  \n   - Three count negligible of the design including systems.\n\n6. **Roofed balconies/outdoor areas on upper floors** Fig. 4(a) 5(5).  \n   [Note: This appears to be a repetition or continuation of point 5; transcribed as visible.]\n\n**Facades with defined**  \n**stoops and porches pleasant**  \n**and friendly as long as**  \n**they do not sit out of scale.**  \n\n**The gross floor area**  \n**appropriately sized**  \n**porches and entryways.**\n\n**Difference**  \n**between a porch**  \n**feature:**\n\n**A factor is to be considered from**  \n**an entry feature if it can**  \n**clearly accommodate more**  \n**leaving the house, and**\n\nThe following pages address the details of assessing these features with regard to gross floor area.\n\n**Section 3**  \n**[Illegible or cut off; possibly a page number or footer.]**\n\n---\n\nThis extraction captures all visible text elements, including headings, body text, numbered lists, side notes, and footnotes. The content appears to focus on zoning rules and technical specifications for porches and entry features in the context of floor area assessments (e.g., what counts toward gross floor area, height/depth considerations, and categorizations). If additional images or pages are provided, I can extract from those as well.",
    "content_length": 2884,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:58:03",
  "model": "x-ai/grok-4",
  "success": true
}