{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_52.png",
  "image_name": "Page_52.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible text, tables, figures, and diagrams from the provided image representation. I have captured everything verbatim and with absolute fidelity to what is shown, without adding, deducing, interpreting, or fabricating any information. I have organized it into sections for clarity (e.g., text blocks, tables, figures), but these organizational labels are not part of the original content—they are solely to structure the extraction. Descriptions of visual elements (e.g., diagrams) are limited strictly to what is observable, without assumptions or inferences.\n\n### Main Title/Heading\nHeight  \nGrade  \n\n### Primary Text Block\nHeight allowances enable a variety of architectural styles while preserving the neighborhoods as wall as the privacy and natural light available to each lot.\n\n### Table\n| Structure                  | Max. height to roof peak |\n|----------------------------|--------------------------|\n| Main dwelling on standard lot | 30' peak                |\n| Main dwelling on standard lot | 27'                     |\n| with roof R-12             | 27'                     |\n| Main dwelling on standard lot |                      |\n| Accessory dwelling on rear or side yard | 17'      |\n| 2nd story addition         | 17'                     |\n\n*(Note: The table appears slightly misaligned in the image, with some rows potentially intended to merge or continue from previous lines, but this is extracted exactly as presented.)*\n\n### Figure 41\nFig 41 Determining shape of roof  \n\n- Diagram: A simple line drawing of a pitched roof on a structure, with an arrow pointing to the roof slope labeled \"12\" (vertical) and a horizontal arrow below labeled \"12\" (horizontal run).  \n- Additional diagram text:  \n  Roof slope is vertical rise vs. horizontal run. e.g. of houses called out \"The Roof\"  \n  Figure is showing the slope  \n  (or similar—text is partially obscured or abbreviated in the image)  \n- Small arrow pointing to the base of the diagram, with a horizontal line labeled.  \n\n### Figure 42\nFig 42 Computation of roof slope.  \n\n- Diagram: A row of five simple line drawings of houses with varying pitched roof shapes, each labeled with height measurements at the base. From left to right:  \n  - First house: Labeled \"32-14\" at the base, with roof height \"Height lost - 32'\".  \n  - Second house: Labeled \"13-12\" at the base, with roof height \"Height lost - 27'\".  \n  - Third house: Labeled \"13-10\" at the base, with roof height \"Height lost - ??\" (partially obscured).  \n  - Fourth house: Labeled \"13-6\" at the base, with roof height \"Height lost - ??\" (partially obscured).  \n  - Fifth house: Labeled \"13-2\" at the base, with roof height \"Height lost - ??\" (partially obscured).  \n- Additional diagram text below the row:  \n  Height lost - 32'  \n  Height lost - 27'  \n\n### Footer/Additional Labels\n- Bottom-left: 4.2  \n- Bottom-right: Ao  \n\n*(No other text, rules, regulations, or specifications are visible in the provided image representation beyond what is extracted above.)*",
    "content_length": 3035,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:03:32",
  "model": "x-ai/grok-4",
  "success": true
}