{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_45.png",
  "image_name": "Page_45.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible and legible text, labels, notes, and diagram elements from the provided image of the city planning technical manual page. I have captured everything with absolute fidelity to the content shown, organizing it into sections for clarity (e.g., title, body text, notes, figure descriptions, and key/legend). I have not added, inferred, or deduced any information beyond what is explicitly present—no assumptions about context, missing details, or implications have been made. Any apparent typos, abbreviations, or inconsistencies in the original are preserved as-is.\n\n### Page Title\nDetached garages/carports site planning\n\n### Main Body Text\nFrom the front lot line at least 20' from the street side lot line at least 10'\n\n- Additionally, on lots less than 50' deep, they may be located in the interior side yard if  \n  Garage and carport that are taking advantage of this setback exception are subject to a stricter  \n  Fig 25-30-32. Example site plan showing for detached garages/carports.\n\n(This text appears incomplete or cut off in the image, but I have extracted it verbatim.)\n\n### Diagram/Figure\nThe image contains a single horizontal diagram divided into three labeled sections (A, B, and C), depicting site plans with shaded areas, lines, labels, and icons (e.g., car icons). The diagram includes arrows, measurements, and boundaries. Specific elements extracted:\n\n- **Overall Diagram Labels**:\n  - Horizontal lines and arrows indicating boundaries, with labels such as:\n    - \"Zoning\"\n    - \"Interior side\"\n    - \"Rear yard\"\n    - \"Street side\"\n    - \"Front yard\"\n  - Shaded rectangular areas labeled as:\n    - \"Dwelling\"\n    - \"Detached garage\"\n    - \"Carport\"\n    - \"2-car garage\"\n  - Measurement labels:\n    - \"20'\"\n    - \"10'\"\n    - \"3'\"\n    - \"5'\"\n    - \"7' min\"\n  - Icons: Small car-like symbols inside shaded areas.\n\n- **Section A**: Labeled \"A Garage Uncovered space in rear yard. 40\"\n  - Depicts a shaded \"Dwelling\" area at the front, with a \"Detached garage\" in the rear, connected by lines showing setbacks.\n\n- **Section B**: Labeled \"B Carport Uncovered space in side yard. 40\"\n  - Depicts a shaded \"Dwelling\" area, with a \"Carport\" adjacent in the side yard, including setback lines.\n\n- **Section C**: Labeled \"C 2-car garage Uncovered space in rear yard. 40\"\n  - Depicts a shaded \"Dwelling\" area, with a \"2-car garage\" in the rear, including setback lines.\n\n### Side Notes\n- **Top-Right Note**:  \n  Note: Uncovered space must be  \n  yard beyond the first 10' of the  \n  rear yard.  \n\n- **Bottom-Left Note**:  \n  Note: In all cases the 2-car garage because from a 3-car garage.  \n\n(This note appears potentially incomplete or garbled in the image, but extracted verbatim.)\n\n### Key/Legend\nLocated at the bottom-right of the diagram, with colored/shaded boxes and labels:\n- Dwelling (light gray shade)\n- Detached garage (medium gray shade)\n- Carport (medium gray shade)\n- 2-car garage (medium gray shade)\n- Uncovered space (white/unshaded)\n- Parking (black shade)\n\n### Additional Page Elements\n- Page number: 39 (at the bottom-right).\n- No other visible text, rules, regulations, or specifications beyond what's extracted above. The image appears to be a photocopy with some potential artifacts (e.g., slight blurriness in labels), but all legible content has been captured precisely.",
    "content_length": 3348,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:02:24",
  "model": "x-ai/grok-4",
  "success": true
}