{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_51.png",
  "image_name": "Page_51.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible and legible content from the provided image (which appears to be a photocopied page from a city planning technical manual). I have transcribed all text exactly as it appears, without any additions, deductions, interpretations, or assumptions. Where text is partially obscured, garbled, or unclear due to the image quality (e.g., from photocopying artifacts), I have noted it as such without filling in gaps. Diagrams are described factually based solely on visible elements, without inferring meaning or additional details.\n\nThis extraction focuses on capturing zoning rules, regulations, and technical specifications as presented, grouped by sections for clarity. No information has been invented or deduced.\n\n### Page Title\nDetached 2nd-dwelling units & associated parking site planning\n\n### Figure Caption\nFig. [illegible, possibly \"3.1\" or similar] of site planning for detached 2nd-dwelling units and associated parking.\n\n### Section A\n**Label:** A dwelling unit detached  \n**Description:**  \n- Dwelling unit detached  \n- group. Because it's detached and on  \nlocated in the rear yard or  \ninterior space. [Rear yard setback]  \n\n**Diagram:** A rectangular diagram showing a labeled \"Detached Unit\" structure positioned in what appears to be a rear area, with an arrow pointing to it. Adjacent labels include \"Rear yard\" and a dashed line indicating a boundary or setback.\n\n### Section B\n**Label:** B Attached parking from main dwelling  \n**Description:**  \n- Dwelling unit x 1 attached  \n- group. Because it's attached and of  \nlocated in the building can have four  \n- both with building can have four  \n\n**Diagram:** A rectangular diagram showing a labeled \"Attached Parking\" area connected to a main structure, with an arrow pointing to it. Adjacent labels include \"Interior for example\" and structural outlines.\n\n### Section C\n**Label:** C non-dwelling parking attached  \n**Description:**  \n- Because it's detached and of  \noccupied in the rear side [illegible, possibly \"yard\"?]  \n\n**Diagram:** A rectangular diagram showing a labeled \"Detached Parking\" area separate from the main structure, with an arrow pointing to it. Adjacent labels include \"Interior lot example\" and parking-related outlines.\n\n### Section D\n**Label:** D parking that shows a 1-car  \n**Description:**  \n- parking shows a 1-car dwelling  \n- both. Can the drawing for front  \n[illegible, possibly \"yard\"?]  \n\n**Diagram:** A rectangular diagram showing a labeled \"Detached Parking\" area, with an arrow pointing to it. Adjacent labels include \"Rear yard\" and what appears to be a driveway or access path.\n\n### Key/Legend (at bottom of page)\n- Curb  \n- Sidewalk  \n- [Triangular symbol] 2nd-dwelling unit  \n- [Rectangular symbol] Parking  \n- [Dashed or shaded area] Detached unit [illegible, possibly \"or something similar\"]  \n- [Additional symbol, possibly a line or arrow] [illegible]  \n\n**Diagram Layout:** The four sections (A, B, C, D) are arranged horizontally across the page, each with its own diagram above the descriptions. A horizontal line connects them, with labels like \"Key\" and symbols below.\n\n### Additional Page Elements\n- Page number: 45 (at bottom right).  \n- No other visible text, rules, regulations, or specifications beyond what's transcribed above. The content appears to focus on site planning configurations for detached secondary dwelling units (e.g., accessory dwelling units or similar) and associated parking, with emphasis on detachment, attachment, rear yard placement, and interior spaces. Diagrams illustrate spatial arrangements, setbacks, and parking integrations, but no numerical measurements (e.g., specific setback distances in feet) are legible.\n\nIf additional images or pages are provided, I can extract from them similarly. This extraction is based solely on the content in the query.",
    "content_length": 3850,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:03:23",
  "model": "x-ai/grok-4",
  "success": true
}