{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_43.png",
  "image_name": "Page_43.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of all visible and legible text, diagrams, and other elements from the provided image of the photocopied page from the city planning technical manual. I have captured everything exactly as it appears in the image, without any additions, deductions, interpretations, or invented details. The content appears to describe zoning rules and regulations related to \"contextual garage placement,\" including a step-by-step determination process, diagrams, and a figure example. I have organized the extraction for clarity (e.g., grouping text sections and describing diagrams verbatim), but the wording and structure are reproduced faithfully from the image.\n\n### Page Title\nContextual garage placement\n\n### Main Description\nContextual garage placement applies II, and only if, there is a predominant neighborhood patterns.\n\n### Subsection: How to Determine\nHow to determine if contextual garage placement applies (Fig 12 below as an example)\n\n* Block is more than 600' long, consider only lots in A or B (2 lots on the closed subject lot\n\nTo determine if type of lot\n\n[Diagram appears here—see Diagram 1 below for extraction]\n\nThe screening including the lot\n\nRear-half patterns lots\n\n[Diagram appears here—see Diagram 2 below for extraction]\n\nRear half\n\n[Diagram appears here—see Diagram 3 below for extraction]\n\nThe contextual pattern (DOES\n\nApplies on the lot\n\nNot half of the lot.\n\nThe garage on the street front\n\n### Figure Caption\nFig. Example of a block to which contextual garage placement regulation applies\n\n### Diagrams\nThe page includes three simple line-drawn diagrams (arranged side-by-side or in sequence) with labels and arrows. Below is a textual representation and extraction of each, based exactly on the visible elements in the image (no assumptions about missing or unclear parts).\n\n- **Diagram 1 (Leftmost, labeled at top as \"To determine if type of lot\")**:\n  - Box with text: \"Corner lot A with B\"\n  - Arrow pointing right to another box with text: \"The screening including the lot\"\n  - Additional label below: \"The screening including the lot\"\n\n- **Diagram 2 (Middle, labeled at top as \"To the screening, including lot\")**:\n  - Box with text: \"Rear-half patterns lots\"\n  - Arrow pointing right with labels: \"Rear half • B and D\"\n  - Additional label below: \"a new construction lot\"\n\n- **Diagram 3 (Rightmost, labeled at top as \"Rear half\")**:\n  - Box with text: \"Rear half\"\n  - Arrow pointing right with label: \"Applies on the lot\"\n  - Additional labels: \"The contextual pattern (DOES\" (text cuts off here) and \"Not half of the lot.\"\n\n### Additional Figure (Bottom of Page)\nA larger horizontal diagram spans the bottom of the page, depicting a block layout with labeled sections. It includes:\n- Rectangular shapes representing lots or buildings, crossed out or marked with \"X\" in some areas.\n- Labels on sections (from left to right):\n  - \"A\"\n  - \"B\"\n  - \"Subject\"\n  - \"Reuse\"\n  - \"Plane\"\n- A horizontal line or bar across the middle with additional markings (e.g., brackets or dividers).\n- No additional text beyond the figure caption already extracted above.\n\n### Page Footer\n37\n\n### Notes on Image Quality and Completeness\n- The image appears to be a photocopy, with some text slightly blurred or cut off (e.g., \"applies II\" may be a scanning artifact for \"applies to,\" but I have not altered it; \"DOES\" appears incomplete).\n- No other text, rules, regulations, or specifications are visible beyond what is extracted above.\n- Diagrams are schematic and not to scale; they seem to illustrate zoning patterns for garage placement in a neighborhood block context.\n\nIf you provide additional images or pages, I can extract from them in the same manner.",
    "content_length": 3699,
    "parse_error": false
  },
  "timestamp": "2025-09-16 13:02:21",
  "model": "x-ai/grok-4",
  "success": true
}