{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_10.png",
  "image_name": "Page_10.png",
  "analysis": {
    "raw_content": "Below is a precise extraction of the visible text and information from the provided image of the city planning technical manual page. I have transcribed it verbatim, preserving the exact wording, formatting, structure, and any apparent typos, abbreviations, or incomplete phrases as they appear in the image (e.g., without correcting \"sto holds\" or filling in gaps). I have not added, deduced, or inferred any missing information, rules, regulations, or specifications. The content is organized into sections based on the visible headings and layout for clarity, but only using the exact text present.\n\n### Lot & Floor Area Terms\n- Terms used to describe the amount of development on a lot.\n\n### Lot coverage\n- Maximum allowable  \n  Allowable lot coverage is expressed by a ratio - % of the lot area.  \n  Example calculation  \n  For a 7,000 sf lot, the allowable lot coverage would be:  \n  0.35 x 7,000 sf = 2,450 sf\n\n- Lot coverage includes  \n  Footprint of all structures including main structure, equipment units, sto holds, covered porches, patios, structures such as backyards, pergolas, decks that exceed 36\" above grade. For pro-  \n  tion that exceed 36\" above grade.\n\n- Lot coverage excludes  \n  An additional structure that is permitted above ground, potions, carports and roof overhangs beyond 4 feet.  \n  Note: -qualified as a structure that is less than 30\" above grade. Open railings above 30\" inches - half wall, etc.\n\n### Gross Floor Area\n- Maximum allowable gross floor area is expressed by a ratio - the ratio of the lot area to the allowable gross floor area. Allowable gross floor area is expressed as a % of the lot area. One half of the lot is 50% of the lot area. Example: any portion of a lot over 1,500 sf is 30% of that portion.  \n  Example calculation  \n  For a 7,000 sf lot, the allowable gross floor area would be:  \n  0.4 x 5,000 sf = 2,300 sf  \n  0.3 x 2,000 sf = 600 sf  \n  Total = 2,900 sf\n\n- Gross Floor Area includes  \n  - starwell to all floors and attics and areas that greater  \n  - attached garages and accessory buildings which are  \n  - covered parking and accessory buildings for which floor equivalents.\n\n- Notes: The main house may not exceed the size of the lot regardless of the size of the lot.\n\nNo additional text, diagrams, or details are visible in the provided image beyond what is transcribed above. If more images or pages are provided, I can extract from them similarly.",
    "content_length": 2423,
    "parse_error": false
  },
  "timestamp": "2025-09-16 12:57:36",
  "model": "x-ai/grok-4",
  "success": true
}