{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_17.png",
  "image_name": "Page_17.png",
  "analysis": {
    "page_analysis": {
      "text_content": "Vaulted entry features\n\nEntry features that are greater than 12' high are called “vaulted entry features”. The footprint of such features count twice toward gross floor area regardless of the design (including whether or not they are open).\n\nHow to measure the height of an entry feature in order to determine whether or not it is considered to be a vaulted entry feature (using Fig 6 - 8 as examples)\n\nFig 6 Entry feature with shed roof\n\nNote: If the entryway is considered to be a vaulted entryway the area will be counted as follows:\n• In this example, a portion of the entryway is recessed beyond the house facade and roof. It is included in the area that counts.\n• The area is measured to the outside material of the entryway feature.\n• The area counts TWICE toward gross floor area.",
      "visual_elements": [
        {
          "type": "figure",
          "description": "Isometric View of an entry feature with a shed roof attached to a building facade. The height is measured from grade to the top of the roof material. Dashed vertical line indicates the plane of the front facade. The height dimension is marked with a vertical arrow. The grade level is indicated at the base.",
          "location": "bottom left"
        },
        {
          "type": "figure",
          "description": "Side Elevation view of the entry feature showing the height measurement from grade to the intersection of the front facade and top of roof material. The height dimension is marked with a vertical arrow. Dashed vertical line indicates the facade plane.",
          "location": "bottom middle"
        },
        {
          "type": "figure",
          "description": "Porch Floor Plan showing the outline of the entryway roof and the outline of the entryway floor area that counts TWICE if the entryway is vaulted. The floor area outline extends beyond the facade, indicating a recessed portion of the entryway.",
          "location": "bottom right"
        }
      ],
      "technical_specifications": [
        {
          "parameter": "Height threshold for vaulted entry features",
          "value_type": "Measurement",
          "value": "12",
          "unit": "feet"
        },
        {
          "parameter": "Gross floor area counting multiplier for vaulted entry features",
          "value_type": "Numerical",
          "value": "2",
          "unit": "times"
        }
      ],
      "structural_elements": {
        "main_heading": "Vaulted entry features",
        "subheadings": [],
        "sections": []
      },
      "additional_notes": [
        "Page number 11 at bottom right corner.",
        "No handwritten annotations or stamps detected.",
        "Text and figures are clear and legible."
      ],
      "cross_references": [
        "References to Fig 6 - 8 for examples on measuring height of entry features."
      ],
      "conditions_and_qualifiers": {
        "qualifiers": [
          {
            "id": "q1",
            "text": "Entry features that are greater than 12' high are called “vaulted entry features”.",
            "applies_to_conditions": [
              "c1"
            ],
            "scope": "Global"
          }
        ],
        "conditions": [
          {
            "id": "c1",
            "text": "The footprint of such features count twice toward gross floor area regardless of the design (including whether or not they are open).",
            "value_type": "Numerical",
            "operator": "=",
            "threshold_value": "2",
            "unit": "times"
          }
        ],
        "logical_relationships": [
          {
            "operation": "IF-THEN",
            "condition_ids": [
              "c1"
            ],
            "expression": "If entry feature height > 12' (q1), then footprint counts twice toward gross floor area (c1).",
            "evaluation_order": 1
          }
        ],
        "execution_sequence": [
          {
            "step": 1,
            "action": "Measure height of entry feature from grade to top of roof material.",
            "condition_ids": [],
            "qualifier_ids": [],
            "dependencies": []
          },
          {
            "step": 2,
            "action": "Determine if height is greater than 12 feet to classify as vaulted entry feature.",
            "condition_ids": [
              "c1"
            ],
            "qualifier_ids": [
              "q1"
            ],
            "dependencies": [
              1
            ]
          },
          {
            "step": 3,
            "action": "If vaulted, count footprint area twice toward gross floor area regardless of design or openness.",
            "condition_ids": [
              "c1"
            ],
            "qualifier_ids": [
              "q1"
            ],
            "dependencies": [
              2
            ]
          }
        ]
      }
    }
  },
  "analysis_timestamp": "2025-09-14 20:23:25",
  "model_used": "openai/gpt-4.1-mini"
}