{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_46.png",
  "image_name": "Page_46.png",
  "analysis": {
    "page_analysis": {
      "text_content": "Basements & Excavated features\n\nFloor area regulations are intended to address the building mass and the appearance of the streetscape. Therefore, if basement area is below grade and does not contribute to the apparent mass of a building, that area, even if it is habitable, need not be included in the total floor area.\n\nCode sections\nPage 40\n18.12.090 (a, b, & c)\nPage 41\n18.12.090 (c)\nPage 43\n18.12.090 (c) (1)\nPage 44\n18.12.090 (c) (2)\n\nBasement standards\n\n• May not be located in special flood hazard areas.\n• May not extend beyond building footprint.\n• May not encroach into required yards, except where main dwelling is permitted to extend into rear yard.\n\nFAR\nBasements (even habitable ones) do not count as floor area if first floor is no more than 3' above grade.\n\nFig 35 Basement & grade\n\nExcavated features\n\nThere are two types of excavated features:\n• Light wells and stairwells\n• Below-grade patios\n\nFAR\nExcavation will not affect grade or measurement of floor area if standards are met (see pages 42 and 43).\n\nFig 36 Excavated feature & grade\n\nA: distance between top of first floor and grade if excavation meets the size/dimensional limits described in Figs 39-40 on pp. 42-43.\n\nB: distance between top of first floor and grade if excavated features exceed the size/dimensional limits described in Figs 39-40 on pp. 42-43.\n\nTop of first floor\n\nGrade if excavated features meet standards described in Figs 39-40 on pp. 42-43.\n\nGrade if excavated features exceed standards described in Figs 39-40 on pp. 42-43.",
      "visual_elements": [
        {
          "type": "diagram",
          "description": "A cross-sectional diagram showing a building with basement and excavated feature areas. It illustrates two vertical measurements labeled A and B from the top of the first floor down to the grade line. The basement and excavated feature areas are shaded differently. Labels indicate 'Basement' and 'Excavated feature'. The diagram explains that measurement A applies if excavation meets size/dimensional limits, and measurement B applies if excavated features exceed those limits. Additional notes clarify how grade is determined based on whether excavated features meet or exceed standards.",
          "location": "Bottom right of the page"
        },
        {
          "type": "patterned graphic",
          "description": "A patterned graphic representing basement and grade area, composed of a repeated hatch pattern forming a stepped shape.",
          "location": "Bottom center-left of the page"
        },
        {
          "type": "shaded text boxes",
          "description": "Two shaded grey text boxes containing FAR (Floor Area Ratio) rules: one for basements stating they do not count as floor area if first floor is no more than 3' above grade; the other for excavated features stating excavation will not affect grade or floor area measurement if standards are met (with reference to pages 42 and 43).",
          "location": "Middle of the page, one under Basement standards and one under Excavated features"
        },
        {
          "type": "sidebar",
          "description": "A vertical dark grey sidebar on the left side of the page containing the section title 'Basements & Excavated features', a descriptive paragraph about floor area regulations, and a list of code sections with page references.",
          "location": "Left side of the page"
        }
      ],
      "technical_specifications": [
        {
          "parameter": "Basement floor area inclusion",
          "value": "3",
          "unit": "feet above grade"
        }
      ],
      "structural_elements": {
        "main_heading": "Basements & Excavated features",
        "subheadings": [
          "Basement standards",
          "Excavated features"
        ],
        "sections": [
          "Code sections",
          "Basement standards",
          "Excavated features"
        ]
      },
      "additional_notes": [
        "Page number 40 is indicated at bottom left corner.",
        "References to figures 35 and 36 are present under respective sections.",
        "References to figures 39-40 on pages 42-43 are noted for dimensional limits and standards.",
        "No handwritten annotations or stamps detected.",
        "Text is clear and legible."
      ],
      "cross_references": [
        "see pages 42 and 43",
        "Figs 39-40 on pp. 42-43",
        "Code sections Page 40 18.12.090 (a, b, & c)",
        "Page 41 18.12.090 (c)",
        "Page 43 18.12.090 (c) (1)",
        "Page 44 18.12.090 (c) (2)"
      ]
    }
  },
  "analysis_timestamp": "2025-09-14 19:41:38",
  "model_used": "openai/gpt-4.1-mini"
}