{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_45.png",
  "image_name": "Page_45.png",
  "analysis": {
    "page_analysis": {
      "text_content": "Detached garages/carports site planning\n\n• Detached garages and carports may be located in the rear or interior side yard if at least 75' from the front lot line and at least 20' from the street-side lot line.\n• Additionally, on lots less than 95' deep, they may be located in rear or interior side yards if placed in rear half of the lot.\n• Garages and carports that take advantage of this setback exception are subject to a stricter daylight plane. See Figs 25-26 p. 32.\n\nFig 34 Examples of site planning solutions for detached garages/carports\n\nGarages at the lot line must comply with Uniform Building Code (UBC) requirements for fire-rated walls & roof materials.\n\n2-car Garage w/rated walls\n\nInterior lot example\n\nRear yard\n\n3' min.\n\nCarports with open sides must be at least 3' from any lot line.\n\n2-car Carport w/open sides\n\nInterior lot example\n\nRear yard\n\n2-car Garage w/rated walls\n\nCorner lot example\n\nRear yard\n\n20' min\n\n10'\n\nNote: Uncovered spaces must be located beyond the required front-yard and beyond the first 10' of the street-side yard.\n\nNote: In all the examples on this page, a 1-car garage could be substituted for a 2-car garage because there is room for uncovered parking in the driveway.\n\nKey\nCurb\nLot line\nSidewalk\nRequired setbacks\nBuildable area\nDwelling\nParking structure\nNo-parking area\nUncovered space\n\nA 2-car garage w/uncovered spaces in driveway (tandem OK)\nB 2-car carport w/uncovered spaces in driveway (tandem OK)\nC 2-car garage w/uncovered spaces in driveway (tandem OK)",
      "visual_elements": [
        {
          "type": "diagram",
          "description": "Three side-by-side site plan diagrams labeled A, B, and C illustrating examples of detached garages/carports site planning. Each diagram shows a lot layout with a main dwelling, buildable area, front yard, rear yard, interior side yards, and street-side yard. Diagram A shows a 2-car garage with rated walls at the rear yard with uncovered spaces in the driveway (tandem OK). Diagram B shows a 2-car carport with open sides at the rear yard with uncovered spaces in the driveway (tandem OK). Diagram C shows a 2-car garage with rated walls at the corner lot rear yard with uncovered spaces in the driveway (tandem OK). Each diagram includes measurements such as minimum 75' or midpoint for lots less than 95' deep, 3' minimum distance from lot lines for carports, 20' minimum from street-side lot line, and 10' from street-side yard for uncovered spaces. The diagrams also include annotations about compliance with Uniform Building Code (UBC) for fire-rated walls and roof materials, and the requirement for carports to be at least 3' from any lot line.",
          "location": "Bottom two-thirds of the page"
        },
        {
          "type": "text box",
          "description": "Gray shaded box on the right side of the page containing the note: 'Note: Uncovered spaces must be located beyond the required front-yard and beyond the first 10' of the street-side yard.'",
          "location": "Upper right side of the page"
        },
        {
          "type": "key/legend",
          "description": "Key explaining symbols used in the diagrams: solid line for curb, dashed line for lot line, shaded pattern for sidewalk, dashed area for required setbacks, dotted area for buildable area, solid gray for dwelling, solid black for parking structure, diagonal lines for no-parking area, and car icon for uncovered space.",
          "location": "Right side, below the gray note box"
        }
      ],
      "technical_specifications": [
        {
          "parameter": "Minimum distance from front lot line for detached garages/carports",
          "value": "75",
          "unit": "feet"
        },
        {
          "parameter": "Minimum distance from street-side lot line for detached garages/carports",
          "value": "20",
          "unit": "feet"
        },
        {
          "parameter": "Lot depth threshold for rear or interior side yard location",
          "value": "95",
          "unit": "feet"
        },
        {
          "parameter": "Minimum distance carports with open sides must be from any lot line",
          "value": "3",
          "unit": "feet"
        },
        {
          "parameter": "Minimum distance for uncovered spaces from street-side yard",
          "value": "10",
          "unit": "feet"
        },
        {
          "parameter": "Minimum distance for uncovered spaces from street-side lot line",
          "value": "20",
          "unit": "feet"
        }
      ],
      "structural_elements": {
        "main_heading": "Detached garages/carports site planning",
        "subheadings": [],
        "sections": []
      },
      "additional_notes": [
        "Page number 39 at bottom right corner.",
        "No handwritten annotations or stamps present.",
        "Text and diagrams are clear and legible."
      ],
      "cross_references": [
        "See Figs 25-26 p. 32 for daylight plane requirements."
      ]
    }
  },
  "analysis_timestamp": "2025-09-14 19:41:34",
  "model_used": "openai/gpt-4.1-mini"
}