{
  "image_path": "/Users/jayklein/Documents/rulestracking/cityrules/pngs/Page_31.png",
  "image_name": "Page_31.png",
  "analysis": {
    "page_analysis": {
      "text_content": "Allowable extensions to existing encroachments\n\nFig 19 Allowable extensions of existing walls that encroach into required yards (on ground floor only)\n\nA Extension of existing side yard encroachment\nAn existing wall that encroaches into the required interior side yard setback but is at least 5'-0\" from the property line, may be extended at the same setback, in one direction only, at the ground floor only, for a distance equal to the length of the existing wall or 20' whichever is less.\nNote: In the example below, two existing walls are encroaching--only one of them may be extended.\n\nB Extension of existing front yard encroachment\nAn existing wall that encroaches into the required front yard setback but is at least 14'-0\" from the property line, may be extended at the same setback, in one direction only, at the ground floor only, with both of the following provisions:\n1) the length of the extension is no greater than that of the existing encroaching wall,\n2) the combined length is no greater than one-half the maximum width of the house.\n\nC Extension of existing street-side yard encroachment\nAn existing wall that encroaches into the required street side yard setback but is at least 10'-0\" from the property line, may be extended at the same setback, in one direction only, at the ground floor only, for a distance equal to the length of the existing wall or 20' whichever is less.\n\nNote:\n• Encroaching walls that don't meet the minimum setback given for each case i.e., 5', 14', and 10', may not be extended nor may they may not be stepped back and then extended.\n• Multiple protrusions are not permitted; addition must be contiguous with existing protrusion.\n• Only for structures that were legally constructed, without a variance or an home-improvement exception (HIE).\n• Only once in the life of the structure.\n• Requires retention of the non-complying wall.\n• Exceptions apply to special setbacks as well.\n\nKey\n- Lot line\n- Required setback\n- Buildable area\n- Sidewalk\n\nExisting house\nAddition",
      "visual_elements": [
        {
          "type": "diagram",
          "description": "Three adjacent lot diagrams illustrating allowable extensions of existing walls that encroach into required yards. Each lot is divided into rear yard, interior/side yard, and front yard areas. The first diagram (A) shows an extension of an existing side yard encroachment with a 5' minimum setback from the property line. The second diagram (B) shows an extension of an existing front yard encroachment with a 14' minimum setback and indicates the length of existing encroaching wall and half the width of the building max. The third diagram (C) shows an extension of an existing street-side yard encroachment with a 10' minimum setback. The diagrams use shading to differentiate existing house (light gray) and addition (black). Various dashed and solid lines indicate lot lines, required setbacks, buildable area, and sidewalks. Annotations specify minimum setback distances and extension limits.",
          "location": "Middle of the page"
        }
      ],
      "technical_specifications": [
        {
          "parameter": "Minimum setback for side yard encroachment",
          "value": "5",
          "unit": "feet"
        },
        {
          "parameter": "Maximum extension distance for side yard encroachment",
          "value": "length of existing wall or 20",
          "unit": "feet"
        },
        {
          "parameter": "Minimum setback for front yard encroachment",
          "value": "14",
          "unit": "feet"
        },
        {
          "parameter": "Maximum combined length of front yard encroachment",
          "value": "no greater than one-half the maximum width of the house",
          "unit": "N/A"
        },
        {
          "parameter": "Minimum setback for street-side yard encroachment",
          "value": "10",
          "unit": "feet"
        },
        {
          "parameter": "Maximum extension distance for street-side yard encroachment",
          "value": "length of existing wall or 20",
          "unit": "feet"
        }
      ],
      "structural_elements": {
        "main_heading": "Allowable extensions to existing encroachments",
        "subheadings": [
          "A Extension of existing side yard encroachment",
          "B Extension of existing front yard encroachment",
          "C Extension of existing street-side yard encroachment",
          "Note",
          "Key"
        ],
        "sections": [
          "Fig 19",
          "A",
          "B",
          "C",
          "Note",
          "Key"
        ]
      },
      "additional_notes": [
        "Text is clear and legible with no visible quality issues.",
        "No handwritten annotations or stamps present."
      ],
      "cross_references": [
        "Fig 19 referenced in main heading",
        "No other section or page references noted."
      ]
    }
  },
  "analysis_timestamp": "2025-09-14 19:41:16",
  "model_used": "openai/gpt-4.1-mini"
}